zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxe/pinctrl/MCXE245VLF-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXE245VLF/signal_configuration.xml
 *
 * Copyright 2025 NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXE245VLF_
#define _ZEPHYR_DTS_BINDING_MCXE245VLF_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define CMP0_IN0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define ADC0_SE0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define FTM2_CH1_PTA0 KINETIS_MUX('A',0,2) /* PTA_0 */
#define LPI2C0_SCLS_PTA0 KINETIS_MUX('A',0,3) /* PTA_0 */
#define FXIO_D2_PTA0 KINETIS_MUX('A',0,4) /* PTA_0 */
#define FTM2_QD_PHA_PTA0 KINETIS_MUX('A',0,5) /* PTA_0 */
#define LPUART0_CTS_PTA0 KINETIS_MUX('A',0,6) /* PTA_0 */
#define TRGMUX_OUT3_PTA0 KINETIS_MUX('A',0,7) /* PTA_0 */
#define ADC0_SE1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define CMP0_IN1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA_1 */
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,2) /* PTA_1 */
#define LPI2C0_SDAS_PTA1 KINETIS_MUX('A',1,3) /* PTA_1 */
#define FXIO_D3_PTA1 KINETIS_MUX('A',1,4) /* PTA_1 */
#define FTM1_QD_PHA_PTA1 KINETIS_MUX('A',1,5) /* PTA_1 */
#define LPUART0_RTS_PTA1 KINETIS_MUX('A',1,6) /* PTA_1 */
#define TRGMUX_OUT0_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define ADC1_SE0_PTA2 KINETIS_MUX('A',2,0) /* PTA_2 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA_2 */
#define FTM3_CH0_PTA2 KINETIS_MUX('A',2,2) /* PTA_2 */
#define LPI2C0_SDA_PTA2 KINETIS_MUX('A',2,3) /* PTA_2 */
#define EWM_OUT_b_PTA2 KINETIS_MUX('A',2,4) /* PTA_2 */
#define FXIO_D4_PTA2 KINETIS_MUX('A',2,5) /* PTA_2 */
#define LPUART0_RX_PTA2 KINETIS_MUX('A',2,6) /* PTA_2 */
#define ADC1_SE1_PTA3 KINETIS_MUX('A',3,0) /* PTA_3 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA_3 */
#define FTM3_CH1_PTA3 KINETIS_MUX('A',3,2) /* PTA_3 */
#define LPI2C0_SCL_PTA3 KINETIS_MUX('A',3,3) /* PTA_3 */
#define EWM_IN_PTA3 KINETIS_MUX('A',3,4) /* PTA_3 */
#define FXIO_D5_PTA3 KINETIS_MUX('A',3,5) /* PTA_3 */
#define LPUART0_TX_PTA3 KINETIS_MUX('A',3,6) /* PTA_3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define CMP0_OUT_PTA4 KINETIS_MUX('A',4,4) /* PTA_4 */
#define EWM_OUT_b_PTA4 KINETIS_MUX('A',4,5) /* PTA_4 */
#define JTAG_TMS_SWD_DIO_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA_5 */
#define TCLK1_PTA5 KINETIS_MUX('A',5,3) /* PTA_5 */
#define RESET_b_PTA5 KINETIS_MUX('A',5,7) /* PTA_5 */
#define ADC0_SE3_PTA7 KINETIS_MUX('A',7,0) /* PTA_7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA_7 */
#define FTM0_FLT2_PTA7 KINETIS_MUX('A',7,2) /* PTA_7 */
#define RTC_CLKIN_PTA7 KINETIS_MUX('A',7,4) /* PTA_7 */
#define LPUART1_RTS_PTA7 KINETIS_MUX('A',7,6) /* PTA_7 */
#define PTA10 KINETIS_MUX('A',10,1) /* PTA_10 */
#define FTM1_CH4_PTA10 KINETIS_MUX('A',10,2) /* PTA_10 */
#define FXIO_D0_PTA10 KINETIS_MUX('A',10,4) /* PTA_10 */
#define JTAG_TDO_noetm_TRACE_SWO_PTA10 KINETIS_MUX('A',10,7) /* PTA_10 */
#define PTA11 KINETIS_MUX('A',11,1) /* PTA_11 */
#define FTM1_CH5_PTA11 KINETIS_MUX('A',11,2) /* PTA_11 */
#define FXIO_D1_PTA11 KINETIS_MUX('A',11,4) /* PTA_11 */
#define CMP0_RRT_PTA11 KINETIS_MUX('A',11,5) /* PTA_11 */
#define PTA12 KINETIS_MUX('A',12,1) /* PTA_12 */
#define FTM1_CH6_PTA12 KINETIS_MUX('A',12,2) /* PTA_12 */
#define CAN1_RX_PTA12 KINETIS_MUX('A',12,3) /* PTA_12 */
#define FTM2_QD_PHB_PTA12 KINETIS_MUX('A',12,6) /* PTA_12 */
#define PTA13 KINETIS_MUX('A',13,1) /* PTA_13 */
#define FTM1_CH7_PTA13 KINETIS_MUX('A',13,2) /* PTA_13 */
#define CAN1_TX_PTA13 KINETIS_MUX('A',13,3) /* PTA_13 */
#define FTM2_QD_PHA_PTA13 KINETIS_MUX('A',13,6) /* PTA_13 */
#define ADC1_SE14_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define ADC0_SE4_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define LPUART0_RX_PTB0 KINETIS_MUX('B',0,2) /* PTB_0 */
#define LPSPI0_PCS0_PTB0 KINETIS_MUX('B',0,3) /* PTB_0 */
#define LPTMR0_ALT3_PTB0 KINETIS_MUX('B',0,4) /* PTB_0 */
#define CAN0_RX_PTB0 KINETIS_MUX('B',0,5) /* PTB_0 */
#define ADC1_SE15_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define ADC0_SE5_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define LPUART0_TX_PTB1 KINETIS_MUX('B',1,2) /* PTB_1 */
#define LPSPI0_SOUT_PTB1 KINETIS_MUX('B',1,3) /* PTB_1 */
#define TCLK0_PTB1 KINETIS_MUX('B',1,4) /* PTB_1 */
#define CAN0_TX_PTB1 KINETIS_MUX('B',1,5) /* PTB_1 */
#define ADC0_SE6_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB_2 */
#define FTM1_CH0_PTB2 KINETIS_MUX('B',2,2) /* PTB_2 */
#define LPSPI0_SCK_PTB2 KINETIS_MUX('B',2,3) /* PTB_2 */
#define FTM1_QD_PHB_PTB2 KINETIS_MUX('B',2,4) /* PTB_2 */
#define TRGMUX_IN3_PTB2 KINETIS_MUX('B',2,6) /* PTB_2 */
#define ADC0_SE7_PTB3 KINETIS_MUX('B',3,0) /* PTB_3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB_3 */
#define FTM1_CH1_PTB3 KINETIS_MUX('B',3,2) /* PTB_3 */
#define LPSPI0_SIN_PTB3 KINETIS_MUX('B',3,3) /* PTB_3 */
#define FTM1_QD_PHA_PTB3 KINETIS_MUX('B',3,4) /* PTB_3 */
#define TRGMUX_IN2_PTB3 KINETIS_MUX('B',3,6) /* PTB_3 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB_4 */
#define FTM0_CH4_PTB4 KINETIS_MUX('B',4,2) /* PTB_4 */
#define LPSPI0_SOUT_PTB4 KINETIS_MUX('B',4,3) /* PTB_4 */
#define TRGMUX_IN1_PTB4 KINETIS_MUX('B',4,6) /* PTB_4 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB_5 */
#define FTM0_CH5_PTB5 KINETIS_MUX('B',5,2) /* PTB_5 */
#define LPSPI0_PCS1_PTB5 KINETIS_MUX('B',5,3) /* PTB_5 */
#define LPSPI0_PCS0_PTB5 KINETIS_MUX('B',5,4) /* PTB_5 */
#define CLKOUT_PTB5 KINETIS_MUX('B',5,5) /* PTB_5 */
#define TRGMUX_IN0_PTB5 KINETIS_MUX('B',5,6) /* PTB_5 */
#define XTAL_PTB6 KINETIS_MUX('B',6,0) /* PTB_6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB_6 */
#define LPI2C0_SDA_PTB6 KINETIS_MUX('B',6,2) /* PTB_6 */
#define EXTAL_PTB7 KINETIS_MUX('B',7,0) /* PTB_7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB_7 */
#define LPI2C0_SCL_PTB7 KINETIS_MUX('B',7,2) /* PTB_7 */
#define ADC1_SE8_PTB13 KINETIS_MUX('B',13,0) /* PTB_13 */
#define ADC0_SE8_PTB13 KINETIS_MUX('B',13,0) /* PTB_13 */
#define PTB13 KINETIS_MUX('B',13,1) /* PTB_13 */
#define FTM0_CH1_PTB13 KINETIS_MUX('B',13,2) /* PTB_13 */
#define FTM3_FLT1_PTB13 KINETIS_MUX('B',13,3) /* PTB_13 */
#define CAN2_TX_PTB13 KINETIS_MUX('B',13,4) /* PTB_13 */
#define ADC0_SE9_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define FTM0_CH1_PTC1 KINETIS_MUX('C',1,2) /* PTC_1 */
#define LPSPI2_SOUT_PTC1 KINETIS_MUX('C',1,3) /* PTC_1 */
#define FTM1_CH7_PTC1 KINETIS_MUX('C',1,6) /* PTC_1 */
#define CMP0_IN5_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define ADC0_SE10_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC_2 */
#define FTM0_CH2_PTC2 KINETIS_MUX('C',2,2) /* PTC_2 */
#define CAN0_RX_PTC2 KINETIS_MUX('C',2,3) /* PTC_2 */
#define LPUART0_RX_PTC2 KINETIS_MUX('C',2,4) /* PTC_2 */
#define ADC0_SE11_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define CMP0_IN4_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define FTM0_CH3_PTC3 KINETIS_MUX('C',3,2) /* PTC_3 */
#define CAN0_TX_PTC3 KINETIS_MUX('C',3,3) /* PTC_3 */
#define LPUART0_TX_PTC3 KINETIS_MUX('C',3,4) /* PTC_3 */
#define CMP0_IN2_PTC4 KINETIS_MUX('C',4,0) /* PTC_4 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define FTM1_CH0_PTC4 KINETIS_MUX('C',4,2) /* PTC_4 */
#define RTC_CLKOUT_PTC4 KINETIS_MUX('C',4,3) /* PTC_4 */
#define EWM_IN_PTC4 KINETIS_MUX('C',4,5) /* PTC_4 */
#define FTM1_QD_PHB_PTC4 KINETIS_MUX('C',4,6) /* PTC_4 */
#define JTAG_TCLK_SWD_CLK_PTC4 KINETIS_MUX('C',4,7) /* PTC_4 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define FTM2_CH0_PTC5 KINETIS_MUX('C',5,2) /* PTC_5 */
#define RTC_CLKOUT_PTC5 KINETIS_MUX('C',5,3) /* PTC_5 */
#define FTM2_QD_PHB_PTC5 KINETIS_MUX('C',5,6) /* PTC_5 */
#define JTAG_TDI_PTC5 KINETIS_MUX('C',5,7) /* PTC_5 */
#define ADC1_SE4_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define LPUART1_RX_PTC6 KINETIS_MUX('C',6,2) /* PTC_6 */
#define CAN1_RX_PTC6 KINETIS_MUX('C',6,3) /* PTC_6 */
#define FTM3_CH2_PTC6 KINETIS_MUX('C',6,4) /* PTC_6 */
#define FTM1_QD_PHB_PTC6 KINETIS_MUX('C',6,6) /* PTC_6 */
#define ADC1_SE5_PTC7 KINETIS_MUX('C',7,0) /* PTC_7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC_7 */
#define LPUART1_TX_PTC7 KINETIS_MUX('C',7,2) /* PTC_7 */
#define CAN1_TX_PTC7 KINETIS_MUX('C',7,3) /* PTC_7 */
#define FTM3_CH3_PTC7 KINETIS_MUX('C',7,4) /* PTC_7 */
#define FTM1_QD_PHA_PTC7 KINETIS_MUX('C',7,6) /* PTC_7 */
#define PTC8 KINETIS_MUX('C',8,1) /* PTC_8 */
#define LPUART1_RX_PTC8 KINETIS_MUX('C',8,2) /* PTC_8 */
#define FTM1_FLT0_PTC8 KINETIS_MUX('C',8,3) /* PTC_8 */
#define LPUART0_CTS_PTC8 KINETIS_MUX('C',8,6) /* PTC_8 */
#define PTC9 KINETIS_MUX('C',9,1) /* PTC_9 */
#define LPUART1_TX_PTC9 KINETIS_MUX('C',9,2) /* PTC_9 */
#define FTM1_FLT1_PTC9 KINETIS_MUX('C',9,3) /* PTC_9 */
#define LPUART0_RTS_PTC9 KINETIS_MUX('C',9,6) /* PTC_9 */
#define ADC0_SE12_PTC14 KINETIS_MUX('C',14,0) /* PTC_14 */
#define PTC14 KINETIS_MUX('C',14,1) /* PTC_14 */
#define FTM1_CH2_PTC14 KINETIS_MUX('C',14,2) /* PTC_14 */
#define LPSPI2_PCS0_PTC14 KINETIS_MUX('C',14,3) /* PTC_14 */
#define TRGMUX_IN9_PTC14 KINETIS_MUX('C',14,6) /* PTC_14 */
#define ADC0_SE13_PTC15 KINETIS_MUX('C',15,0) /* PTC_15 */
#define PTC15 KINETIS_MUX('C',15,1) /* PTC_15 */
#define FTM1_CH3_PTC15 KINETIS_MUX('C',15,2) /* PTC_15 */
#define LPSPI2_SCK_PTC15 KINETIS_MUX('C',15,3) /* PTC_15 */
#define TRGMUX_IN8_PTC15 KINETIS_MUX('C',15,6) /* PTC_15 */
#define ADC0_SE14_PTC16 KINETIS_MUX('C',16,0) /* PTC_16 */
#define PTC16 KINETIS_MUX('C',16,1) /* PTC_16 */
#define FTM1_FLT2_PTC16 KINETIS_MUX('C',16,2) /* PTC_16 */
#define CAN2_RX_PTC16 KINETIS_MUX('C',16,3) /* PTC_16 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define FTM0_CH2_PTD0 KINETIS_MUX('D',0,2) /* PTD_0 */
#define LPSPI1_SCK_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define FTM2_CH0_PTD0 KINETIS_MUX('D',0,4) /* PTD_0 */
#define FXIO_D0_PTD0 KINETIS_MUX('D',0,6) /* PTD_0 */
#define TRGMUX_OUT1_PTD0 KINETIS_MUX('D',0,7) /* PTD_0 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD_1 */
#define FTM0_CH3_PTD1 KINETIS_MUX('D',1,2) /* PTD_1 */
#define LPSPI1_SIN_PTD1 KINETIS_MUX('D',1,3) /* PTD_1 */
#define FTM2_CH1_PTD1 KINETIS_MUX('D',1,4) /* PTD_1 */
#define FXIO_D1_PTD1 KINETIS_MUX('D',1,6) /* PTD_1 */
#define TRGMUX_OUT2_PTD1 KINETIS_MUX('D',1,7) /* PTD_1 */
#define ADC1_SE2_PTD2 KINETIS_MUX('D',2,0) /* PTD_2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define FTM3_CH4_PTD2 KINETIS_MUX('D',2,2) /* PTD_2 */
#define LPSPI1_SOUT_PTD2 KINETIS_MUX('D',2,3) /* PTD_2 */
#define FXIO_D4_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define FXIO_D6_PTD2 KINETIS_MUX('D',2,5) /* PTD_2 */
#define TRGMUX_IN5_PTD2 KINETIS_MUX('D',2,6) /* PTD_2 */
#define ADC1_SE3_PTD3 KINETIS_MUX('D',3,0) /* PTD_3 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD_3 */
#define FTM3_CH5_PTD3 KINETIS_MUX('D',3,2) /* PTD_3 */
#define LPSPI1_PCS0_PTD3 KINETIS_MUX('D',3,3) /* PTD_3 */
#define FXIO_D5_PTD3 KINETIS_MUX('D',3,4) /* PTD_3 */
#define FXIO_D7_PTD3 KINETIS_MUX('D',3,5) /* PTD_3 */
#define TRGMUX_IN4_PTD3 KINETIS_MUX('D',3,6) /* PTD_3 */
#define NMI_b_PTD3 KINETIS_MUX('D',3,7) /* PTD_3 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD_5 */
#define FTM2_CH3_PTD5 KINETIS_MUX('D',5,2) /* PTD_5 */
#define LPTMR0_ALT2_PTD5 KINETIS_MUX('D',5,3) /* PTD_5 */
#define FTM2_FLT1_PTD5 KINETIS_MUX('D',5,4) /* PTD_5 */
#define TRGMUX_IN7_PTD5 KINETIS_MUX('D',5,6) /* PTD_5 */
#define PTD15 KINETIS_MUX('D',15,1) /* PTD_15 */
#define FTM0_CH0_PTD15 KINETIS_MUX('D',15,2) /* PTD_15 */
#define LPSPI0_SCK_PTD15 KINETIS_MUX('D',15,4) /* PTD_15 */
#define PTD16 KINETIS_MUX('D',16,1) /* PTD_16 */
#define FTM0_CH1_PTD16 KINETIS_MUX('D',16,2) /* PTD_16 */
#define LPSPI0_SIN_PTD16 KINETIS_MUX('D',16,4) /* PTD_16 */
#define CMP0_RRT_PTD16 KINETIS_MUX('D',16,5) /* PTD_16 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE_4 */
#define FTM2_QD_PHB_PTE4 KINETIS_MUX('E',4,3) /* PTE_4 */
#define FTM2_CH2_PTE4 KINETIS_MUX('E',4,4) /* PTE_4 */
#define CAN0_RX_PTE4 KINETIS_MUX('E',4,5) /* PTE_4 */
#define FXIO_D6_PTE4 KINETIS_MUX('E',4,6) /* PTE_4 */
#define EWM_OUT_b_PTE4 KINETIS_MUX('E',4,7) /* PTE_4 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE_5 */
#define TCLK2_PTE5 KINETIS_MUX('E',5,2) /* PTE_5 */
#define FTM2_QD_PHA_PTE5 KINETIS_MUX('E',5,3) /* PTE_5 */
#define FTM2_CH3_PTE5 KINETIS_MUX('E',5,4) /* PTE_5 */
#define CAN0_TX_PTE5 KINETIS_MUX('E',5,5) /* PTE_5 */
#define FXIO_D7_PTE5 KINETIS_MUX('E',5,6) /* PTE_5 */
#define EWM_IN_PTE5 KINETIS_MUX('E',5,7) /* PTE_5 */
#define CMP0_IN3_PTE8 KINETIS_MUX('E',8,0) /* PTE_8 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE_8 */
#define FTM0_CH6_PTE8 KINETIS_MUX('E',8,2) /* PTE_8 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE_9 */
#define FTM0_CH7_PTE9 KINETIS_MUX('E',9,2) /* PTE_9 */
#define LPUART2_CTS_PTE9 KINETIS_MUX('E',9,3) /* PTE_9 */
#endif
